{"class_name": "Model", "config": {"name": "GoogleNet_v1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_13"}, "name": "input_13", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_244", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_244", "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_271", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_271", "inbound_nodes": [[["conv2d_244", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_59", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_59", "inbound_nodes": [[["activation_271", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "LRN_8", "trainable": true, "dtype": "float32", "node_def": {"name": "LRN_8", "op": "LRN", "input": ["max_pooling2d_59/Identity"], "attr": {"alpha": {"f": 1.0}, "depth_radius": {"i": "5"}, "bias": {"f": 1.0}, "T": {"type": "DT_FLOAT"}, "beta": {"f": 0.5}}}, "constants": {}}, "name": "tf_op_layer_LRN_8", "inbound_nodes": [[["max_pooling2d_59", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_245", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_245", "inbound_nodes": [[["tf_op_layer_LRN_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_272", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_272", "inbound_nodes": [[["conv2d_245", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_246", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_246", "inbound_nodes": [[["activation_272", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_273", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_273", "inbound_nodes": [[["conv2d_246", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "LRN_9", "trainable": true, "dtype": "float32", "node_def": {"name": "LRN_9", "op": "LRN", "input": ["activation_273/Identity"], "attr": {"T": {"type": "DT_FLOAT"}, "beta": {"f": 0.5}, "alpha": {"f": 1.0}, "depth_radius": {"i": "5"}, "bias": {"f": 1.0}}}, "constants": {}}, "name": "tf_op_layer_LRN_9", "inbound_nodes": [[["activation_273", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_60", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_60", "inbound_nodes": [[["tf_op_layer_LRN_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_248", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_248", "inbound_nodes": [[["max_pooling2d_60", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_250", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_250", "inbound_nodes": [[["max_pooling2d_60", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_61", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "max_pooling2d_61", "inbound_nodes": [[["max_pooling2d_60", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_275", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_275", "inbound_nodes": [[["conv2d_248", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_277", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_277", "inbound_nodes": [[["conv2d_250", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_279", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_279", "inbound_nodes": [[["max_pooling2d_61", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_247", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_247", "inbound_nodes": [[["max_pooling2d_60", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_249", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_249", "inbound_nodes": [[["activation_275", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_251", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_251", "inbound_nodes": [[["activation_277", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_252", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_252", "inbound_nodes": [[["activation_279", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_274", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_274", "inbound_nodes": [[["conv2d_247", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_276", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_276", "inbound_nodes": [[["conv2d_249", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_278", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_278", "inbound_nodes": [[["conv2d_251", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_280", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_280", "inbound_nodes": [[["conv2d_252", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_36", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_36", "inbound_nodes": [[["activation_274", 0, 0, {}], ["activation_276", 0, 0, {}], ["activation_278", 0, 0, {}], ["activation_280", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_254", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_254", "inbound_nodes": [[["concatenate_36", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_256", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_256", "inbound_nodes": [[["concatenate_36", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_62", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "max_pooling2d_62", "inbound_nodes": [[["concatenate_36", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_282", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_282", "inbound_nodes": [[["conv2d_254", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_284", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_284", "inbound_nodes": [[["conv2d_256", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_286", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_286", "inbound_nodes": [[["max_pooling2d_62", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_253", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_253", "inbound_nodes": [[["concatenate_36", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_255", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_255", "inbound_nodes": [[["activation_282", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_257", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_257", "inbound_nodes": [[["activation_284", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_258", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_258", "inbound_nodes": [[["activation_286", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_281", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_281", "inbound_nodes": [[["conv2d_253", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_283", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_283", "inbound_nodes": [[["conv2d_255", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_285", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_285", "inbound_nodes": [[["conv2d_257", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_287", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_287", "inbound_nodes": [[["conv2d_258", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_37", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_37", "inbound_nodes": [[["activation_281", 0, 0, {}], ["activation_283", 0, 0, {}], ["activation_285", 0, 0, {}], ["activation_287", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_63", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_63", "inbound_nodes": [[["concatenate_37", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_260", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_260", "inbound_nodes": [[["max_pooling2d_63", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_262", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_262", "inbound_nodes": [[["max_pooling2d_63", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_64", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "max_pooling2d_64", "inbound_nodes": [[["max_pooling2d_63", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_289", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_289", "inbound_nodes": [[["conv2d_260", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_291", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_291", "inbound_nodes": [[["conv2d_262", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_293", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_293", "inbound_nodes": [[["max_pooling2d_64", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_259", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_259", "inbound_nodes": [[["max_pooling2d_63", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_261", "trainable": true, "dtype": "float32", "filters": 208, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_261", "inbound_nodes": [[["activation_289", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_263", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_263", "inbound_nodes": [[["activation_291", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_264", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_264", "inbound_nodes": [[["activation_293", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_288", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_288", "inbound_nodes": [[["conv2d_259", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_290", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_290", "inbound_nodes": [[["conv2d_261", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_292", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_292", "inbound_nodes": [[["conv2d_263", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_294", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_294", "inbound_nodes": [[["conv2d_264", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_38", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_38", "inbound_nodes": [[["activation_288", 0, 0, {}], ["activation_290", 0, 0, {}], ["activation_292", 0, 0, {}], ["activation_294", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_267", "trainable": true, "dtype": "float32", "filters": 112, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_267", "inbound_nodes": [[["concatenate_38", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_269", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_269", "inbound_nodes": [[["concatenate_38", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_65", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "max_pooling2d_65", "inbound_nodes": [[["concatenate_38", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_296", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_296", "inbound_nodes": [[["conv2d_267", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_298", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_298", "inbound_nodes": [[["conv2d_269", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_300", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_300", "inbound_nodes": [[["max_pooling2d_65", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_266", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_266", "inbound_nodes": [[["concatenate_38", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_268", "trainable": true, "dtype": "float32", "filters": 224, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_268", "inbound_nodes": [[["activation_296", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_270", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_270", "inbound_nodes": [[["activation_298", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_271", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_271", "inbound_nodes": [[["activation_300", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_295", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_295", "inbound_nodes": [[["conv2d_266", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_297", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_297", "inbound_nodes": [[["conv2d_268", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_299", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_299", "inbound_nodes": [[["conv2d_270", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_301", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_301", "inbound_nodes": [[["conv2d_271", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_39", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_39", "inbound_nodes": [[["activation_295", 0, 0, {}], ["activation_297", 0, 0, {}], ["activation_299", 0, 0, {}], ["activation_301", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_273", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_273", "inbound_nodes": [[["concatenate_39", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_275", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_275", "inbound_nodes": [[["concatenate_39", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_66", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "max_pooling2d_66", "inbound_nodes": [[["concatenate_39", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_303", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_303", "inbound_nodes": [[["conv2d_273", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_305", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_305", "inbound_nodes": [[["conv2d_275", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_307", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_307", "inbound_nodes": [[["max_pooling2d_66", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_272", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_272", "inbound_nodes": [[["concatenate_39", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_274", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_274", "inbound_nodes": [[["activation_303", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_276", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_276", "inbound_nodes": [[["activation_305", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_277", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_277", "inbound_nodes": [[["activation_307", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_302", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_302", "inbound_nodes": [[["conv2d_272", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_304", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_304", "inbound_nodes": [[["conv2d_274", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_306", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_306", "inbound_nodes": [[["conv2d_276", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_308", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_308", "inbound_nodes": [[["conv2d_277", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_40", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_40", "inbound_nodes": [[["activation_302", 0, 0, {}], ["activation_304", 0, 0, {}], ["activation_306", 0, 0, {}], ["activation_308", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_279", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_279", "inbound_nodes": [[["concatenate_40", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_281", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_281", "inbound_nodes": [[["concatenate_40", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_67", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "max_pooling2d_67", "inbound_nodes": [[["concatenate_40", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_310", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_310", "inbound_nodes": [[["conv2d_279", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_312", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_312", "inbound_nodes": [[["conv2d_281", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_314", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_314", "inbound_nodes": [[["max_pooling2d_67", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_278", "trainable": true, "dtype": "float32", "filters": 112, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_278", "inbound_nodes": [[["concatenate_40", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_280", "trainable": true, "dtype": "float32", "filters": 288, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_280", "inbound_nodes": [[["activation_310", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_282", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_282", "inbound_nodes": [[["activation_312", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_283", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_283", "inbound_nodes": [[["activation_314", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_309", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_309", "inbound_nodes": [[["conv2d_278", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_311", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_311", "inbound_nodes": [[["conv2d_280", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_313", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_313", "inbound_nodes": [[["conv2d_282", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_315", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_315", "inbound_nodes": [[["conv2d_283", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_41", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_41", "inbound_nodes": [[["activation_309", 0, 0, {}], ["activation_311", 0, 0, {}], ["activation_313", 0, 0, {}], ["activation_315", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_286", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_286", "inbound_nodes": [[["concatenate_41", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_288", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_288", "inbound_nodes": [[["concatenate_41", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_68", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "max_pooling2d_68", "inbound_nodes": [[["concatenate_41", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_317", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_317", "inbound_nodes": [[["conv2d_286", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_319", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_319", "inbound_nodes": [[["conv2d_288", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_321", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_321", "inbound_nodes": [[["max_pooling2d_68", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_285", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_285", "inbound_nodes": [[["concatenate_41", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_287", "trainable": true, "dtype": "float32", "filters": 320, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_287", "inbound_nodes": [[["activation_317", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_289", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_289", "inbound_nodes": [[["activation_319", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_290", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_290", "inbound_nodes": [[["activation_321", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_316", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_316", "inbound_nodes": [[["conv2d_285", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_318", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_318", "inbound_nodes": [[["conv2d_287", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_320", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_320", "inbound_nodes": [[["conv2d_289", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_322", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_322", "inbound_nodes": [[["conv2d_290", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_42", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_42", "inbound_nodes": [[["activation_316", 0, 0, {}], ["activation_318", 0, 0, {}], ["activation_320", 0, 0, {}], ["activation_322", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_69", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_69", "inbound_nodes": [[["concatenate_42", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_292", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_292", "inbound_nodes": [[["max_pooling2d_69", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_294", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_294", "inbound_nodes": [[["max_pooling2d_69", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_70", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "max_pooling2d_70", "inbound_nodes": [[["max_pooling2d_69", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_324", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_324", "inbound_nodes": [[["conv2d_292", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_326", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_326", "inbound_nodes": [[["conv2d_294", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_328", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_328", "inbound_nodes": [[["max_pooling2d_70", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_291", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_291", "inbound_nodes": [[["max_pooling2d_69", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_293", "trainable": true, "dtype": "float32", "filters": 320, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_293", "inbound_nodes": [[["activation_324", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_295", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_295", "inbound_nodes": [[["activation_326", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_296", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_296", "inbound_nodes": [[["activation_328", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_323", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_323", "inbound_nodes": [[["conv2d_291", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_325", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_325", "inbound_nodes": [[["conv2d_293", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_327", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_327", "inbound_nodes": [[["conv2d_295", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_329", "trainable": true, "dtype": 